#pragma once
#ifndef _LAYERSHAPE_H
#define _LAYERSHAPE_H

const int INPUT_DIM[] = { // 입력될때의 채널의 개수
	3, 64,
	64,

	64,128,
	128,

	128, 256, 256,
	256,

	256, 512, 512,
	512,

	512, 512, 512,
	512,

	512,
	512,
	512
};

const int OUTPUT_DIM[] = { // 나갈때의 채널의 개수
	64, 64,
	64,

	128, 128,
	128,

	256, 256, 256,
	256,

	512, 512, 512,
	512,

	512, 512, 512,
	512,

	512,
	512,
	10
};

const int NBYN[] = { // 나갈때 피쳐맵의 Shape
	32, 32,
	16,

	16, 16,
	8,

	8, 8, 8,
	4,

	4, 4, 4,
	2,

	2, 2, 2,
	1,

	1,
	1,
	1
};

const int TS[] = {
	64, 64,
	16,

	64, 64,
	8,

	64, 64, 64,
	4,

	16, 16, 16,
	2,

	4, 4, 4,
	1,

	1,
	1,
	1
};

#endif